# 1 - ✅         6 - ❌      11 - ✅
# 2 - ✅         7 - ❌
# 3 - ✅         8 - ✅
# 4 - ❌         9 - ❌ 
# 5 - ❌         10 - ❌


# # 1. დაწერეთ ანონიმური ფუნქცია, რომელსაც გადავცემთ პარალელოგრამის
# # სიმაღლეს და ფუძის ზომებს, დათვლის და დააბრუნებს ფართობს.

# print((lambda h, b: h * b) (5, 10))


# # 2. დაწერეთ ანონიმური ფუნქცია, რომელსაც გადავცემთ ტრაპეციის სიმაღლეს და
# # პარალელური გვერდების ზომებს, დათვლის და დააბრუნებს ფართობს.

# print((lambda h, a, b : ((a + b)/2)*h) (4, 5, 6))


# # 3. დაწერეთ ანონიმური ფუნქცია, რომელიც მიიღებს რიცხვს და დააბრუნებს
# # გადუბლირებული სახით 15=1515, 20=2020, 17=1717

# print((lambda x: int(str(x)*2)) (20))


# # 8. ფუნქცია იღებს ორ არგუმენტს, მამის და შვილის ასაკს, უნდა გამოვთვალოთ
# # როდის იყო ან როდის იქნება მამა შვილზე ორჯერ დიდი.

# def fatherOverSon(dad, son):
#     return abs((dad - (son * 2)))


# print(fatherOverSon(25, 15))

# # 11. დაწერეთ ანონიმური ფუნქცია, რომელსაც გადაეცემა სამი რიცხვი და
# # შეამოწმებს პირველის მეორეზე გაყოფისას მიიღება თუ არა მესამე რიცხვი.


# print((lambda a, b, c: a / b == c) (10, 5, 2))